# Install Tmux
brew "tmux"
brew "reattach-to-user-namespace"

# Install command completion tools 
brew "zsh-completions"
brew "bash-completion"
brew "grunt-completion"
brew "vagrant-completion"
brew "docker-completion"
brew "gradle-completion"
brew "pip-completion"
brew "yarn-completion"
cask "fig"

# Install for fun
brew "figlet"
brew "cowsay"
brew "cmatrix"
brew "lolcat"

# Install VirtualBox
# cask "virtualbox"

# Install Kubernetes
brew "kubernetes-cli"
brew "minikube"
brew "kubectx"
tap "atombender/ktail"
brew "atombender/ktail/ktail"

# Install Terraform
brew "terraform"

# Install awscli/awslogs etc.
brew "awscli"
brew "awsebcli"
brew "awslogs"

# Install Node
brew "node"

# Install Go
brew "go"

# Install nvim
brew "neovim"

# Install GnuPG to enable PGP-signing commits.
brew "gnupg"

# Install more recent versions of some macOS tools.
brew "vim"
brew "grep"
brew "openssh"
brew "screen"
brew "php"
brew "gmp"
# https://github.com/Peltoche/lsd/issues/199#issuecomment-494218334
# https://github.com/lsd-rs/lsd/issues/199#issuecomment-499399488
brew "lsd"
tap "cantino/mcfly"
brew "mcfly"
brew "gping"
brew "httpstat"
cask "rectangle"
cask "boop"
cask "bitwarden"
cask "stats"

# Install font tools.
tap "bramstein/webfonttools"
brew "sfnt2woff"
brew "sfnt2woff-zopfli"
brew "woff2"
tap "homebrew/cask-fonts"
cask "font-hack-nerd-font"

# Install some CTF tools; see https://github.com/ctfs/write-ups.
#brew "aircrack-ng"
#brew "bfg"
#brew "binutils"
#brew "binwalk"
#brew "cifer"
#brew "dex2jar"
#brew "dns2tcp"
#brew "fcrackzip"
#brew "foremost"
#brew "hashpump"
#brew "hydra"
#brew "john"
#brew "knock"
#brew "netpbm"
#brew "nmap"
#brew "pngcheck"
#brew "socat"
#brew "sqlmap"
#brew "tcpflow"
#brew "tcpreplay"
#brew "tcptrace"
# `tcpserver` etc.
#brew "ucspi-tcp
#brew "xpdf"
#brew "xz"

# Install git tools
brew "git"
brew "git-crypt"
brew "git-lfs"

# Install GNU Tools
brew "coreutils"
brew "findutils"
brew "gnu-indent"
brew "gnu-sed"
brew "gnutls"
brew "grep"
brew "gnu-tar"
brew "gawk"
brew "gnu-getopt"

# Install other useful binaries.
brew "ack"
brew "imagemagick"
# text-based web browser
brew "lynx"
brew "p7zip"
brew "pigz"
# pipeline-viewer
brew "pv"
brew "rename"
brew "rlwrap"
brew "ssh-copy-id"
brew "tree"
brew "vbindiff"
# zopfli compression
brew "zopfli"
brew "aria2"
cask "rar"
brew "jq"
brew "thefuck"
brew "viddy"
brew "sshs"
tap "goodwithtech/r"
brew "goodwithtech/r/dockle"
brew "duf"
brew "wget"
brew "gping"
brew "hey"
brew "watch"